Documents/РегистрацияДвиженияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>РегистрацияДвиженияТС</Name>
			<BasedOn>
				<xr:Item>Task.ЗадачаИсполнителя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвиженияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ДвиженияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияТС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьПосещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пропуск</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыдачаПропускаНаТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыПроверки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Посетитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Посетители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаКонтроля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиКонтроля</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДвиженияТС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДвиженияТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Въезд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выезд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РегистрацияДвиженияТС/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
    // Проверка заполнения обязательных полей
    Если НЕ ЗначениеЗаполнено(ДатаВремя) Тогда
        Сообщить("Не указана дата и время движения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТипДвиженияТС) Тогда
        Сообщить("Не указан тип движения!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(Пропуск) Тогда
        Сообщить("Не указан пропуск!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(Посетитель) Тогда
        Сообщить("Не указан посетитель!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТранспортноеСредство) Тогда
        Сообщить("Не указано транспортное средство!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если НЕ ЗначениеЗаполнено(ТочкаКонтроля) Тогда
        Сообщить("Не указана точка контроля!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Инициализация движений
    Движения.ДвиженияТС.Записывать = Истина;

    // Проверяем, что пропуск действующий
    СтатусВыдан = Справочники.СтатусыПропусков.НайтиПоНаименованию("Выдан", Истина);
    Если ТипЗнч(Пропуск) <> Тип("ДокументСсылка.ВыдачаПропускаНаТС") Тогда
        Сообщить("Пропуск должен быть типа 'ВыдачаПропускаНаТС'!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Пропуск.Статус <> СтатусВыдан Тогда
        Сообщить("Пропуск " + Пропуск + " имеет статус " + Пропуск.Статус + ", ожидается 'Выдан'!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Пропуск.ДатаОкончания < НачалоДня(Дата) Тогда
        Сообщить("Пропуск " + Пропуск + " истёк срок действия!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Пропуск.ТранспортноеСредство <> ТранспортноеСредство Тогда
        Сообщить("Транспортное средство " + ТранспортноеСредство + " не соответствует пропуску " + Пропуск + "!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Если Пропуск.ЗонаДоступа <> ЗонаДоступа Тогда
        Сообщить("Зона доступа " + ЗонаДоступа + " не соответствует зоне пропуска " + Пропуск.ЗонаДоступа + "!");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверка уникальности движения по регистратору и дате
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1 Период
    |ИЗ РегистрНакопления.ДвиженияТС
    |ГДЕ Регистратор = &Регистратор
    |    И НАЧАЛОПЕРИОДА(Период, ДЕНЬ) = &Период";
    Запрос.УстановитьПараметр("Регистратор", Ссылка);
    Запрос.УстановитьПараметр("Период", НачалоДня(Дата));

    Если НЕ Запрос.Выполнить().Пустой() Тогда
        Сообщить("Для документа " + Ссылка + " уже зарегистрировано движение на дату " + Формат(НачалоДня(Дата), "ДЛФ=Д") + "! Повторное создание запрещено.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Проверка уникальности движения по пропуску, дате и типу движения
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1 Период
    |ИЗ РегистрНакопления.ДвиженияТС
    |ГДЕ Пропуск = &Пропуск
    |    И НАЧАЛОПЕРИОДА(Период, ДЕНЬ) = &Период
    |    И ТипДвиженияТС = &ТипДвиженияТС
    |    И Регистратор <> &Регистратор";
    Запрос.УстановитьПараметр("Пропуск", Пропуск);
    Запрос.УстановитьПараметр("Период", НачалоДня(Дата));
    Запрос.УстановитьПараметр("ТипДвиженияТС", ТипДвиженияТС);
    Запрос.УстановитьПараметр("Регистратор", Ссылка);

    Если НЕ Запрос.Выполнить().Пустой() Тогда
        Сообщить("Для пропуска " + Пропуск + " уже зарегистрировано движение типа '" + ТипДвиженияТС + "' на дату " + Формат(НачалоДня(Дата), "ДЛФ=Д") + "! Повторное проведение запрещено.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    // Расчет длительности посещения
    ДлительностьПосещения = 0;
    Если ТипДвиженияТС = Перечисления.ТипыДвиженияТС.Выезд Тогда
        // Находим последнее движение "Въезд" для этого пропуска и точки контроля
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ МАКСИМУМ(ДатаВремя) КАК ПоследнийВъезд
        |ИЗ РегистрНакопления.ДвиженияТС
        |ГДЕ Пропуск = &Пропуск
        |    И ТочкаКонтроля = &ТочкаКонтроля
        |    И ТипДвиженияТС = &ТипВъезд
        |    И ДатаВремя <= &ДатаВремя
        |    И Регистратор <> &Регистратор";
        Запрос.УстановитьПараметр("Пропуск", Пропуск);
        Запрос.УстановитьПараметр("ТочкаКонтроля", ТочкаКонтроля);
        Запрос.УстановитьПараметр("ТипВъезд", Перечисления.ТипыДвиженияТС.Въезд);
        Запрос.УстановитьПараметр("ДатаВремя", ДатаВремя);
        Запрос.УстановитьПараметр("Регистратор", Ссылка);
        Выборка = Запрос.Выполнить().Выбрать();
        Если Выборка.Следующий() И Выборка.ПоследнийВъезд <> Null Тогда
            // Расчет длительности на основе полной даты и времени
            ДлительностьПосещения = (ДатаВремя - Выборка.ПоследнийВъезд) / 60; // В минутах
            Если ДлительностьПосещения < 0 Тогда
                Сообщить("Дата и время выезда не могут быть меньше даты и времени въезда!");
                Отказ = Истина;
                Возврат;
            КонецЕсли;
        Иначе
            Сообщить("Для пропуска " + Пропуск + " не найден предыдущий въезд через точку контроля " + ТочкаКонтроля + "!");
            Отказ = Истина;
            Возврат;
        КонецЕсли;
    КонецЕсли;

    // Формируем движение
    Движение = Движения.ДвиженияТС.Добавить();
    Движение.Период = НачалоДня(Дата); 
	Движение.ДатаВремя = ДатаВремя; 
	Движение.Посетитель = Посетитель;
    Движение.ТранспортноеСредство = ТранспортноеСредство;
    Движение.ЗонаДоступа = ЗонаДоступа;
    Движение.ТочкаКонтроля = ТочкаКонтроля;
    Движение.ТипДвиженияТС = ТипДвиженияТС;
    Движение.ДлительностьПосещения = ДлительностьПосещения;
    Движение.Пропуск = Пропуск;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
    Движения.ДвиженияТС.Записывать = Истина;
    Движения.ДвиженияТС.Очистить();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
    Если НЕ ЗначениеЗаполнено(ДатаВремя) Тогда
        Сообщить("Дата и время движения должны быть заполнены!");
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры
